{
	"version": "https://jsonfeed.org/version/1",
	"title": "Jared W. Smith",
	"icon": "https://micro.blog/jaredwsmith/avatar.jpg",
	"home_page_url": "https://jaredwsmith.com/",
	"feed_url": "https://jaredwsmith.com/feed.json",
	"items": [
		
			{
				"id": "http://jaredwsmith.micro.blog/2021/08/02/i-think-the.html",
				
				"content_html": "<p>I think the time is coming to ditch my 4K TN-paneled monitor that I&rsquo;ve got attached to my Mac mini. I don&rsquo;t game, I live in text, and I am still unaware of anything better than an IPS panel for textual applications. (I honestly wonder how much eyestrain I&rsquo;ve incurred because of the TN panel.)</p>\n\n<p>Trying to decide if going ultrawide is worth it at this point, or if I should just stick to a standard wide IPS display with a second monitor rotated into portrait as I have today. If I go ultrawide, I can take the secondary monitor (which has an IPS panel) and move it over to my AWIPS workstation, replacing another older TN panel. On the other hand, I recoil at the price of high-DPI ultrawides, so I might just do the swap.</p>\n",
				"content_text": "I think the time is coming to ditch my 4K TN-paneled monitor that I've got attached to my Mac mini. I don't game, I live in text, and I am still unaware of anything better than an IPS panel for textual applications. (I honestly wonder how much eyestrain I've incurred because of the TN panel.)\n\nTrying to decide if going ultrawide is worth it at this point, or if I should just stick to a standard wide IPS display with a second monitor rotated into portrait as I have today. If I go ultrawide, I can take the secondary monitor (which has an IPS panel) and move it over to my AWIPS workstation, replacing another older TN panel. On the other hand, I recoil at the price of high-DPI ultrawides, so I might just do the swap.\n",
				"date_published": "2021-08-02T21:23:05-04:00",
				"url": "https://jaredwsmith.com/2021/08/02/i-think-the.html",
				"tags": ["280"]
			},
			{
				"id": "http://jaredwsmith.micro.blog/2021/07/27/macrumors-reports-that.html",
				
				"content_html": "<p>MacRumors <a href=\"https://www.macrumors.com/2021/07/27/ios-15-maps-weather-warnings-routes/\">reports that iOS 15 will route people around Flash Flood Warnings</a>. At first glance, this appears to be an extremely smart application of the Dark Sky acquisition. It will be interesting to see if this only applies to Flash Flood Warnings or other warning types. It would also be interesting to see if it applies to flood advisories as well. We often see impassable roads here with a Flood Advisory in effect because Flash Flood Warnings in my county warning area are reserved for the most serious flooding events.</p>\n",
				"content_text": "MacRumors [reports that iOS 15 will route people around Flash Flood Warnings](https://www.macrumors.com/2021/07/27/ios-15-maps-weather-warnings-routes/). At first glance, this appears to be an extremely smart application of the Dark Sky acquisition. It will be interesting to see if this only applies to Flash Flood Warnings or other warning types. It would also be interesting to see if it applies to flood advisories as well. We often see impassable roads here with a Flood Advisory in effect because Flash Flood Warnings in my county warning area are reserved for the most serious flooding events.\n",
				"date_published": "2021-07-27T08:36:05-04:00",
				"url": "https://jaredwsmith.com/2021/07/27/macrumors-reports-that.html",
				"tags": ["Tech","280","Links"]
			},
			{
				"id": "http://jaredwsmith.micro.blog/2021/07/25/new-shirt-a.html",
				
				"content_html": "<p><img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://jaredwsmith.com/uploads/2021/0f9b02641b.png\" alt=\"AWIPS T-shirt\" title=\"awips-stack-trace – 0016 – Detail.png\" border=\"0\" width=\"600\" height=\"600\" /></p>\n\n<p>New shirt! A little more niche this go-around. Here&rsquo;s a wearable love letter to meteorologists&rsquo; favorite hunk of Java code anywhere, <a href=\"https://cottonbureau.com/products/awips-stack-trace#/10406600/tee-men-standard-tee-vintage-black-tri-blend-s\">AWIPS</a>.</p>\n",
				"content_text": "<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://jaredwsmith.com/uploads/2021/0f9b02641b.png\" alt=\"AWIPS T-shirt\" title=\"awips-stack-trace – 0016 – Detail.png\" border=\"0\" width=\"600\" height=\"600\" />\n\nNew shirt! A little more niche this go-around. Here's a wearable love letter to meteorologists' favorite hunk of Java code anywhere, [AWIPS](https://cottonbureau.com/products/awips-stack-trace#/10406600/tee-men-standard-tee-vintage-black-tri-blend-s).\n",
				"date_published": "2021-07-25T10:55:53-04:00",
				"url": "https://jaredwsmith.com/2021/07/25/new-shirt-a.html",
				"tags": ["280"]
			},
			{
				"id": "http://jaredwsmith.micro.blog/2021/07/17/restart-and-reboot.html",
				"title": "Restart and Reboot Yourself (Again)",
				"content_html": "<p>A year ago, I decided to retire my long-standing WordPress setup for my personal blog and set up a <a href=\"https://jaredwsmith.github.io\">GitHub pages website</a> via Jekyll so that I could accomplish the highly esoteric and somewhat impractical goal of blogging entirely through <code>vim</code>. (Quarantine goals — when we thought the lockdown period would only be about 2-3 weeks — were naively lofty.)</p>\n\n<p>And as it turned out — as so many of my attempts to write on a consistent basis about something other than weather often do — it died on the vine after only five posts. I had the best of intentions, but some <a href=\"https://twitter.com/jaredwsmith\">habits</a> are hard to break.</p>\n\n<p>I&rsquo;ve had good luck with syndication for <a href=\"https://micro.blog/chswx\">@chswx here on micro.blog</a>. There are certainly kinks to work out, especially as it relates to how WordPress handles images and how that translates over to the service, but it has been pretty solid. But, still, some <a href=\"https://twitter.com/chswx\">habits</a> are hard to break. I&rsquo;m trying, though.</p>\n\n<p>At the same time, I&rsquo;ve wanted a place for a while now to briefly comment on links or other things that I&rsquo;ve found useful. However, when considering the cost-benefit analysis of spinning up and maintaining another WordPress install to handle that, it was like…nah. (And yes, I know about WordPress.com&rsquo;s hosted offering. It&rsquo;s good! But too much for what I&rsquo;m trying to do here.)</p>\n\n<p>So, here we are at <code>micro.blog</code>. I&rsquo;ve transitioned the domain name over, so jaredwsmith.com now resolves here (in case you haven&rsquo;t checked your address bar ;)). I&rsquo;m happy about this move for many reasons:</p>\n\n<ul>\n<li>The micro.blog client is good for posting quickly from the hip. I like that.</li>\n<li>$5/mo to handle mostly infrequent long-form writing peppered with a lot of short-form stuff is well worth it for not having to keep up with security patches on a self-hosted service. (And, it keeps the lights on here — micro.blog is a really important project for the indie Web!)</li>\n<li>I get to use my all-time favorite blogging tool again in MarsEdit.</li>\n<li>I get to write long-form within iA Writer and save the drafts up.</li>\n</ul>\n\n<p>In other words, I get to use really good software to do my writing, it is easily exportable and stays with me forever, and I don&rsquo;t have to deal with patches (yet can customize the living you-know-what out of this!) And, if I wanted to, I could still use <code>vim</code>.</p>\n\n<p>With the environmental stuff out of the way, it&rsquo;s once again back on the breaking-old-habits train. See you there?</p>\n",
				"content_text": "A year ago, I decided to retire my long-standing WordPress setup for my personal blog and set up a [GitHub pages website](https://jaredwsmith.github.io) via Jekyll so that I could accomplish the highly esoteric and somewhat impractical goal of blogging entirely through `vim`. (Quarantine goals — when we thought the lockdown period would only be about 2-3 weeks — were naively lofty.)\n\nAnd as it turned out — as so many of my attempts to write on a consistent basis about something other than weather often do — it died on the vine after only five posts. I had the best of intentions, but some [habits](https://twitter.com/jaredwsmith) are hard to break.\n\nI've had good luck with syndication for [@chswx here on micro.blog](https://micro.blog/chswx). There are certainly kinks to work out, especially as it relates to how WordPress handles images and how that translates over to the service, but it has been pretty solid. But, still, some [habits](https://twitter.com/chswx) are hard to break. I'm trying, though.\n\nAt the same time, I've wanted a place for a while now to briefly comment on links or other things that I've found useful. However, when considering the cost-benefit analysis of spinning up and maintaining another WordPress install to handle that, it was like…nah. (And yes, I know about WordPress.com's hosted offering. It's good! But too much for what I'm trying to do here.)\n\nSo, here we are at `micro.blog`. I've transitioned the domain name over, so jaredwsmith.com now resolves here (in case you haven't checked your address bar ;)). I'm happy about this move for many reasons:\n\n- The micro.blog client is good for posting quickly from the hip. I like that.\n- $5/mo to handle mostly infrequent long-form writing peppered with a lot of short-form stuff is well worth it for not having to keep up with security patches on a self-hosted service. (And, it keeps the lights on here — micro.blog is a really important project for the indie Web!)\n- I get to use my all-time favorite blogging tool again in MarsEdit.\n- I get to write long-form within iA Writer and save the drafts up.\n\nIn other words, I get to use really good software to do my writing, it is easily exportable and stays with me forever, and I don't have to deal with patches (yet can customize the living you-know-what out of this!) And, if I wanted to, I could still use `vim`.\n\nWith the environmental stuff out of the way, it's once again back on the breaking-old-habits train. See you there?\n",
				"date_published": "2021-07-17T17:58:28-04:00",
				"url": "https://jaredwsmith.com/2021/07/17/restart-and-reboot.html",
				"tags": ["Meta"]
			},
			{
				"id": "http://jaredwsmith.micro.blog/2021/07/17/safaris-totp-implementation.html",
				"title": "Safari's TOTP implementation in version 15 is pretty cool, though more websites need to adapt to make it truly useful.",
				"content_html": "<p>Just installed Monterey on my MBP and am giving the new Safari two-factor authentication magic a whirl. So far, mixed results for autofill from websites, but it&rsquo;s early. Where it does work, it&rsquo;s phenomenal.</p>\n\n<p>This post by Dan Moren from Six Colors helps you <a href=\"https://sixcolors.com/post/2021/07/migrating-2fa-codes-from-authy-to-apples-system/\">migrate Authy two-factor codes to Safari</a>. it is a little tedious, and depending on how your Authy is set up, it may require a little trial and error, but it <em>works</em> &ndash; a massive timesaver especially since I don&rsquo;t plan on additional migrations to Monterey or iOS 15 for a while yet.</p>\n",
				"content_text": "Just installed Monterey on my MBP and am giving the new Safari two-factor authentication magic a whirl. So far, mixed results for autofill from websites, but it's early. Where it does work, it's phenomenal.\n\nThis post by Dan Moren from Six Colors helps you [migrate Authy two-factor codes to Safari](https://sixcolors.com/post/2021/07/migrating-2fa-codes-from-authy-to-apples-system/). it is a little tedious, and depending on how your Authy is set up, it may require a little trial and error, but it _works_ -- a massive timesaver especially since I don't plan on additional migrations to Monterey or iOS 15 for a while yet.\n",
				"date_published": "2021-07-17T14:20:00-04:00",
				"url": "https://jaredwsmith.com/2021/07/17/safaris-totp-implementation.html",
				"tags": ["Tech"]
			}
	]
}
